---
kind: method
id: M:Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Dispose
source: html/2430f321-c208-95fd-05d1-abe28f9d2858.htm
---
# Autodesk.Revit.DB.ExternalDefinitionCreationOptions.Dispose Method

Releases all resources used by the ExternalDefinitionCreationOptions

## Syntax (C#)
```csharp
public void Dispose()
```